# Lab-Data-Manipulation - Filtering Data

In [3]:
import pandas as pd

# Context 

For this lab you'll use a dataset for UFO observations. The objective is to exercise the manipulation of a dataframe, so we'll use the tools we've learned about `reading`, `renaming`, `selecting specific columns`, `filtering based on conditions` and `merging` dataframes to try to better understand our dataset and store an enriched version of our dataset at the end.

Good Luck.

variable	|class|	description
------------|-----|-------------
date_time	|datetime (mdy h:m)	| Date time sighting occurred
city_area	|character	        | City or area of sighting
state	    |character          |	state/region of sighting
country	    |character          |	Country of sighting
ufo_shape	|character          |	UFO Shape
encounter_length	|double     |	Encounter length in seconds
described_encounter_length	|character |	Encounter length as described (eg 1 hour, etc)
description	|character          |	Description of encounter
date_documented	|character      |	Date documented
latitude	|double             |	Latitude
longitude	|double             |	Longitude

## Read the dataset and store it in a dataframe called `ufo`

Pay attention at the file separator.

In [4]:
ufo = pd.read_csv('C:/Users/wgfra/Aulas_ironhack/docs_for_labs/ufo.csv', sep= ';')
ufo.head()

,Unnamed: 0,date,year,month,day,date_time,city_area,state,country,ufo_shape,encounter_length,described_encounter_length,description,date_documented,latitude,longitude
0,0,1949-10-10,1949,10,10,10/10/1949 20:30,san marcos,tx,us,cylinder,2700.0,45 minutes,This event took place in early fall around 194...,4/27/2004,29.883056,-97.941111
1,1,1949-10-10,1949,10,10,10/10/1949 21:00,lackland afb,tx,NaN,light,7200.0,1-2 hrs,1949 Lackland AFB&#44 TX. Lights racing acros...,12/16/2005,29.384210,-98.581082
2,2,1955-10-10,1955,10,10,10/10/1955 17:00,chester (uk/england),NaN,gb,circle,20.0,20 seconds,Green/Orange circular disc over Chester&#44 En...,1/21/2008,53.200000,-2.916667
3,3,1956-10-10,1956,10,10,10/10/1956 21:00,edna,tx,us,circle,20.0,1/2 hour,My older brother and twin sister were leaving ...,1/17/2004,28.978333,-96.645833
4,4,1960-10-10,1960,10,10,10/10/1960 20:00,kaneohe,hi,us,light,900.0,15 minutes,AS a Marine 1st Lt. flying an FJ4B fighter/att...,1/22/2004,21.418056,-157.803611

## Check the first 6 columns of the dataframe

In [3]:
ufo.iloc[:,1:7]

             date  year  month  day         date_time             city_area
0      1949-10-10  1949     10   10  10/10/1949 20:30            san marcos
1      1949-10-10  1949     10   10  10/10/1949 21:00          lackland afb
2      1955-10-10  1955     10   10  10/10/1955 17:00  chester (uk/england)
3      1956-10-10  1956     10   10  10/10/1956 21:00                  edna
4      1960-10-10  1960     10   10  10/10/1960 20:00               kaneohe
...           ...   ...    ...  ...               ...                   ...
80327  2013-09-09  2013      9    9    9/9/2013 21:15             nashville
80328  2013-09-09  2013      9    9    9/9/2013 22:00                 boise
80329  2013-09-09  2013      9    9    9/9/2013 22:00                  napa
80330  2013-09-09  2013      9    9    9/9/2013 22:20                vienna
80331  2013-09-09  2013      9    9    9/9/2013 23:00                edmond

[80332 rows x 6 columns]

## Check the shape of your dataframe to see how many rows and columns it has

In [4]:
ufo.shape

(80332, 16)

## Bring the date information to the beginning of the dataframe

If you check the dataframe columns, there are some information of the date at the end of the dataframe. For this task, you should reorder the columns in a way that the first few columns all show the date information. 

*Hint: Use the ufo.columns to see all the column names you have.*

In [5]:
ufo.columns

Index(['Unnamed: 0', 'date', 'year', 'month', 'day', 'date_time', 'city_area',
       'state', 'country', 'ufo_shape', 'encounter_length',
       'described_encounter_length', 'description', 'date_documented',
       'latitude', 'longitude'],
      dtype='object')

In [6]:
ufo = ufo[['Unnamed: 0', 'date','date_documented', 'date_time', 'year', 'month', 'day', 'city_area',
       'state', 'country', 'ufo_shape', 'encounter_length',
       'described_encounter_length', 'description', 'latitude', 'longitude']]

## Just check if you did it the right way. Take a look at the head of the dataframe again and see if the `ufo` dataframe now is reordered.

In [7]:
ufo.head()

,Unnamed: 0,date,date_documented,date_time,year,month,day,city_area,state,country,ufo_shape,encounter_length,described_encounter_length,description,latitude,longitude
0,0,1949-10-10,4/27/2004,10/10/1949 20:30,1949,10,10,san marcos,tx,us,cylinder,2700.0,45 minutes,This event took place in early fall around 194...,29.883056,-97.941111
1,1,1949-10-10,12/16/2005,10/10/1949 21:00,1949,10,10,lackland afb,tx,NaN,light,7200.0,1-2 hrs,1949 Lackland AFB&#44 TX. Lights racing acros...,29.384210,-98.581082
2,2,1955-10-10,1/21/2008,10/10/1955 17:00,1955,10,10,chester (uk/england),NaN,gb,circle,20.0,20 seconds,Green/Orange circular disc over Chester&#44 En...,53.200000,-2.916667
3,3,1956-10-10,1/17/2004,10/10/1956 21:00,1956,10,10,edna,tx,us,circle,20.0,1/2 hour,My older brother and twin sister were leaving ...,28.978333,-96.645833
4,4,1960-10-10,1/22/2004,10/10/1960 20:00,1960,10,10,kaneohe,hi,us,light,900.0,15 minutes,AS a Marine 1st Lt. flying an FJ4B fighter/att...,21.418056,-157.803611

## Select a piece of your dataframe. We won't work with the whole dataframe for now, just a few columns. Create a new dataframe called `ufo_vars` and select only the following columns of the `ufo` dataframe. 

`year`, `month`, `state`, `country`, `ufo_shape`, `encounter_length`

In [5]:
ufo_vars = ufo[['year', 'month', 'state', 'country', 'ufo_shape', 'encounter_length',]]

Perform a *.head()* on your result to check if you did it right.

Expected output:

>
> |    |   year |   month | state   | country   | ufo_shape   |   encounter_length |
|---:|-------:|--------:|:--------|:----------|:------------|-------------------:|
|  0 |   1949 |      10 | tx      | us        | cylinder    |               2700 |
|  1 |   1949 |      10 | tx      | nan       | light       |               7200 |
|  2 |   1955 |      10 | nan     | gb        | circle      |                 20 |
|  3 |   1956 |      10 | tx      | us        | circle      |                 20 |
|  4 |   1960 |      10 | hi      | us        | light       |                900 |

In [9]:
ufo_vars.head()

   year  month state country ufo_shape  encounter_length
0  1949     10    tx      us  cylinder            2700.0
1  1949     10    tx     NaN     light            7200.0
2  1955     10   NaN      gb    circle              20.0
3  1956     10    tx      us    circle              20.0
4  1960     10    hi      us     light             900.0

## Rename the variable `encounter_length` to `encounter_seconds`. Keep using the `ufo_vars` dataset for the following tasks, unless specifically specified.

Again, check your results to check if you did it right.

Expected output:

>
>|    |   year |   month | state   | country   | ufo_shape   |   encounter_seconds |
|---:|-------:|--------:|:--------|:----------|:------------|--------------------:|
|  0 |   1949 |      10 | tx      | us        | cylinder    |                2700 |
|  1 |   1949 |      10 | tx      | nan       | light       |                7200 |
|  2 |   1955 |      10 | nan     | gb        | circle      |                  20 |
|  3 |   1956 |      10 | tx      | us        | circle      |                  20 |
|  4 |   1960 |      10 | hi      | us        | light       |                 900 |

In [10]:
ufo_vars = ufo_vars.rename({'encounter_length':'encounter_seconds'}, axis = 1)

In [11]:
ufo_vars.head()

   year  month state country ufo_shape  encounter_seconds
0  1949     10    tx      us  cylinder             2700.0
1  1949     10    tx     NaN     light             7200.0
2  1955     10   NaN      gb    circle               20.0
3  1956     10    tx      us    circle               20.0
4  1960     10    hi      us     light              900.0

## Let's start filtering some records. Create a new dataframe called `ufo_us` and filter the `ufo_vars` dataframe bringing only the results in which the `country` is `"us"`



Expected output:

>
>|    |   year |   month | state   | country   | ufo_shape   |   encounter_seconds |
|---:|-------:|--------:|:--------|:----------|:------------|--------------------:|
|  0 |   1949 |      10 | tx      | us        | cylinder    |                2700 |
|  3 |   1956 |      10 | tx      | us        | circle      |                  20 |
|  4 |   1960 |      10 | hi      | us        | light       |                 900 |
|  5 |   1961 |      10 | tn      | us        | sphere      |                 300 |
|  7 |   1965 |      10 | ct      | us        | disk        |                1200 |

In [44]:
xa = ufo_vars['country'] == 'us'
xa

0         True
1        False
2        False
3         True
4         True
         ...
80327     True
80328     True
80329     True
80330     True
80331     True
Name: country, Length: 80332, dtype: bool

In [45]:
ufo_vars.loc[xa,:]

       year  month state country ufo_shape  encounter_seconds
0      1949     10    tx      us  cylinder             2700.0
3      1956     10    tx      us    circle               20.0
4      1960     10    hi      us     light              900.0
5      1961     10    tn      us    sphere              300.0
7      1965     10    ct      us      disk             1200.0
...     ...    ...   ...     ...       ...                ...
80327  2013      9    tn      us     light              600.0
80328  2013      9    id      us    circle             1200.0
80329  2013      9    ca      us     other             1200.0
80330  2013      9    va      us    circle                5.0
80331  2013      9    ok      us     cigar             1020.0

[65114 rows x 6 columns]

In [6]:
ufo_us = ufo_vars.loc[ufo_vars['country']== 'us']
ufo_us

       year  month state country ufo_shape  encounter_length
0      1949     10    tx      us  cylinder            2700.0
3      1956     10    tx      us    circle              20.0
4      1960     10    hi      us     light             900.0
5      1961     10    tn      us    sphere             300.0
7      1965     10    ct      us      disk            1200.0
...     ...    ...   ...     ...       ...               ...
80327  2013      9    tn      us     light             600.0
80328  2013      9    id      us    circle            1200.0
80329  2013      9    ca      us     other            1200.0
80330  2013      9    va      us    circle               5.0
80331  2013      9    ok      us     cigar            1020.0

[65114 rows x 6 columns]

### Use the `.query()` method to perform the same task as above

In [7]:
ufo_vars.query('ufo_shape == "circle"')

       year  month state country ufo_shape  encounter_length
2      1955     10   NaN      gb    circle              20.0
3      1956     10    tx      us    circle              20.0
6      1965     10   NaN      gb    circle             180.0
10     1968     10    ca      us    circle             300.0
15     1972     10    ky      us    circle            1200.0
...     ...    ...   ...     ...       ...               ...
80303  2012      9    ny      us    circle             600.0
80306  2012      9    ut      us    circle              10.0
80310  2012      9    ca      us    circle             300.0
80328  2013      9    id      us    circle            1200.0
80330  2013      9    va      us    circle               5.0

[7608 rows x 6 columns]

See which one do you prefer the most and keep using it for the exercises that follow

## For the `ufo_us` dataframe, select only the cases in which the year is in the first decade (2001-2010). Put that in a variable called `ufo_us_2000`.

Check your results.

In [8]:
ufo_us_2000 = ufo_us.loc[(ufo_us['year'] >= 2001) & (ufo_us['year']<= 2010),:]
ufo_us_2000

       year  month state country  ufo_shape  encounter_length
102    2001     10    ia      us   triangle             240.0
105    2001     10    ca      us     circle             120.0
106    2001     10    ia      us  rectangle             300.0
107    2001     10    ca      us   changing             900.0
108    2001     10    az      us   triangle              60.0
...     ...    ...   ...     ...        ...               ...
80269  2010      9    mi      us   changing             300.0
80270  2010      9    fl      us       oval            2700.0
80271  2010      9    fl      us       oval            7200.0
80272  2010      9    nm      us   fireball             300.0
80273  2010      9    ca      us     circle             300.0

[31910 rows x 6 columns]

## Try to do the same without the intermediate step of creating the `ufo_us` dataframe. That is, try to filter the dataset for the cases in which the country is "us" and the year is (2001-2010) from the original dataframe.



*Hint:* You have to make sure all of these conditions are applied simultaneously - using the `and` (or `&`) operator. Try to understand when to use the `and` and the `&` operator.

In [9]:
country = (ufo_vars['country'] == 'us')
year2001 = (ufo_us['year'] >= 2001) 
year2010 = (ufo_us['year']<= 2010)

In [10]:
ufo_vars.loc[country & year2001 & year2010, :]

       year  month state country  ufo_shape  encounter_length
102    2001     10    ia      us   triangle             240.0
105    2001     10    ca      us     circle             120.0
106    2001     10    ia      us  rectangle             300.0
107    2001     10    ca      us   changing             900.0
108    2001     10    az      us   triangle              60.0
...     ...    ...   ...     ...        ...               ...
80269  2010      9    mi      us   changing             300.0
80270  2010      9    fl      us       oval            2700.0
80271  2010      9    fl      us       oval            7200.0
80272  2010      9    nm      us   fireball             300.0
80273  2010      9    ca      us     circle             300.0

[31910 rows x 6 columns]

## BONUS 1:  Take a look at the column named `ufo_shape`. Compare the number of triangular UFO occurrances in the US from the year 2001 up to 2010 as compared to the years of 1991 up to 2000.

*Hint: you should expect roughly ~3 times more cases for 2001-2010 than 1991-2000.*

In [11]:
x1 = ufo_vars.loc[country & year2001 & year2010, :]
x1

       year  month state country  ufo_shape  encounter_length
102    2001     10    ia      us   triangle             240.0
105    2001     10    ca      us     circle             120.0
106    2001     10    ia      us  rectangle             300.0
107    2001     10    ca      us   changing             900.0
108    2001     10    az      us   triangle              60.0
...     ...    ...   ...     ...        ...               ...
80269  2010      9    mi      us   changing             300.0
80270  2010      9    fl      us       oval            2700.0
80271  2010      9    fl      us       oval            7200.0
80272  2010      9    nm      us   fireball             300.0
80273  2010      9    ca      us     circle             300.0

[31910 rows x 6 columns]

In [ ]:
year91 = (ufo_us['year'] >= 1991) 
year2000 = (ufo_us['year'] <= 2000)

In [ ]:
triangles = ufo_vars.loc[(ufo_vars['ufo_shape'] == 'triangle')]

In [ ]:
triangles

In [135]:
# calculate the dataframe from 2001-2010 here
ufo_vars.loc[tr, : ]

ValueError: The truth value of a DataFrame is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [ ]:
# calculate the dataframe from 1991-2000 here

How many rows does each dataset have?

## BONUS 1.1: Count how many values does each category of `ufo_shape` has. 

Expected output:

````
        light        16565
        triangle      7865
        circle        7608
        fireball      6208
        other         5649
        unknown       5584
        sphere        5387
        disk          5213
        oval          3733
        formation     2457
        cigar         2057
        changing      1962
        flash         1328
        rectangle     1297
        cylinder      1283
        diamond       1178
        chevron        952
        egg            759
        teardrop       750
        cone           316
        cross          233
        delta            7
        round            2
        crescent         2
        dome             1
        pyramid          1
        changed          1
        hexagon          1
        flare            1
        Name: ufo_shape, dtype: int64

````

In [84]:
ufo_shape.value_count

NameError: name 'ufo_shape' is not defined

### Mask hints 

A `mask` is nothing more than a condition. This condition is applied to your whole dataframe (or pandas Series).
So for example, if you had a pandas Series with a variable called `Age`, you could create a mask for all people whose `Age` is less than 18 years old using the syntax:

`df['Age'] <= 18`

This would return a pandas series containing `True` and `False` values. For each index, you'd get a value of `True` or `False`.

You could save this mask in a variable, for example:

`condition = (df['Age'] <= 18)`

And then you could use that variable `condition` to select only the cases of the dataframe in which the index returned `True` using:
`df.loc[condition, :]`.


### `.query()` hints

Remember that the .query() method expects a string. That string should contain the variable of your dataframe without quotation marks and the comparison. For example, if you had a variable called `name`, you'd use a syntax like:
 `df.query('name == "Jack"')`
 
to bring all observations whose column `name` is exactly equal to `"Jack"` (note that Jack should be within quotation marks because a name is a string in this example).